const puzzles = [
  {
    name: 'pushchair',
    size: { rows: 5, columns: 5 },
    solution: [
      [false, true, true, false, false],
      [true, true, false, false, true],
      [true, true, true, true, false],
      [false, true, true, false, false],
      [true, false, false, true, false],
    ],
  },
  {
    name: 'Cat',
    size: { rows: 10, columns: 10 },
    topHints: [
      [[5], [2], [6], [5], [3], [3], [4], [4], [5], [9]], // Первый ряд верхних подсказок ближе к полю
      [[], [2], [], [2], [5], [], [2], [1], [2], []], // Второй ряд верхних подсказок (над первым рядом)
      [[], [], [], [], [], [], [], [], [], []],
      [[], [], [], [], [], [], [], [], [], []],
      [[], [], [], [], [], [], [], [], [], []], // Пятый ряд верхних подсказок
    ],
    leftHints: [
      [[3], [], [], [], []], // Подсказки для первой строки слева первый внутр массив ближе к полю
      [[2], [1], [1], [1], []], // Подсказки для второй строки
      [[1], [2], [2], [], []],
      [[1], [5], [], [], []],
      [[1], [1], [1], [1], []], // Подсказки для пятой строки
      [[3], [5], [], [], []],
      [[4], [3], [], [], []],
      [[8], [], [], [], []],
      [[8], [], [], [], []],
      [[2], [4], [], [], []], // Подсказки для десятой строки
    ],
  },
  {
    name: 'Umbrella',
    size: { rows: 15, columns: 15 },
    topHints: [
      [
        [3],
        [1],
        [1],
        [2],
        [3],
        [2],
        [1],
        [2],
        [2],
        [1],
        [1],
        [2],
        [1],
        [4],
        [4],
      ], // Первый ряд верхних подсказок ближе к полю
      [[], [1], [1], [2], [3], [3], [4], [2], [1], [4], [5], [1], [1], [1], []], // Второй ряд верхних подсказок (над первым рядом)
      [[], [2], [1], [], [1], [1], [3], [3], [2], [], [2], [], [2], [3], []],
      [[], [], [], [], [], [2], [], [], [], [], [], [], [], [], []],
      [[], [], [], [], [], [1], [], [], [], [], [], [], [], [], []], // Пятый ряд верхних подсказок
    ],
    leftHints: [
      [[2], [], [], [], []], // Подсказки для первой строки слева первый внутр массив ближе к полю
      [[8], [], [], [], []], // Подсказки для второй строки
      [[4], [2], [3], [], []],
      [[2], [1], [2], [2], []],
      [[1], [2], [2], [1], []], // Подсказки для пятой строки
      [[2], [1], [5], [], []],
      [[1], [1], [5], [], []],
      [[1], [6], [], [], []],
      [[5], [1], [], [], []],
      [[2], [], [], [], []], // Подсказки для десятой строки
      [[1], [], [], [], []],
      [[2], [], [], [], []],
      [[1], [1], [], [], []],
      [[2], [2], [], [], []],
      [[2], [1], [3], [2], []], // Подсказки для пятнадцатой строки
    ],
  },
];

export default puzzles;
